"""
# 데이터 분석이란?
"""

"""
# 데이터 분석?

데이터란, 어떤 사실에 대한 측정이나 관찰을 통해 모아놓은 값들의 모음을 말한다.
보통 '모음'이라는 사실을 강조하기 위해 '데이터셋(data set)'이라는 표현도 많이 쓰이기도 한다.

분석이란, 어떤 대상을 더 잘 이해하기 위해, 이를 나누고 쪼개는 것을 말함.

즉 데이터 분석이란, 어떤 대상에 대한 사실을 설명하는 값의 모음을 유효적절한 방법으로
나누고 쪼개서 그 대상을 더 잘 이해하는 것이라고 할 수 있다.
"""

"""
# 빅 데이터에 대한 탐색적 데이터 분석

탐색적 데이터 분석(EDA. exploratory data analysis)은 기계 학습, 자연어 처리,
패턴 인식 등 모든 데이터 과학의 출발점이라고 할 수 있다.
"""

"""
# '빅 데이터'의 등장

빅 데이터(big data)는, 양이 너무 많고 복잡해서, 통상적으로 사용되는 데이터 분석 방법이
잘 적용되지 않는 데이터를 의미한다.
"""

# 코드 셀 1
import subprocess
subprocess.run(["pip", "install", "pandas"], capture_output=True)
